## SWF ファイルの構造 [#vf0b3a46]

ヘッダの後には、タグの付いたデータブロックの列が続きます。
全てのタグは共通のフォーマットで記述され、SWF のパーサプログラムが理解できないタグが出現した場合は、そのブロックを読み飛ばすことができます。ブロックは、ブロック中でオフセットを指すことができますが、他のブロックにまたがるオフセットを指定することはできません。これにより、 SWF ファイルの編集ツールがタグの削除・挿入・変更 をすることが可能になります。 

[FileAttributes](制御タグ_FileAttributes) タグだけは、 SWF 8 以降が必要になります。

### SWF ファイルの構造 [#id150bac]
|Header|[FileAttributes](制御タグ_FileAttributes) タグ|Tag|Tag|Tag|....|[End](制御タグ_End) Tag|

### 移動 [#rcbfca19]
* 前のページ : [SWF ヘッダ](SWFの構造要約_SWF_ヘッダ)
* 次のページ : [タグのフォーマット](SWFの構造要約_タグのフォーマット)
