## ディクショナリ [#ra9ba4f0]

ディクショナリは定義タグによって定義されたキャラクタのリポジトリで、制御タグによって使われます。
ディクショナリの構築のプロセスと使い方を次に示します。
&br;

1. 定義タグによってシェイプ・ビットマップ・サウンド等のコンテンツが定義されます。
1. 定義タグのそれぞれのコンテンツにキャラクタ ID が割り当てられます。
1. ディクショナリの中に、コンテンツがキャラクタ ID ごとに保存されます。
1. 制御タグがキャラクタ ID を使って、ディクショナリの中からコンテンツを取得し、何らかの操作を行います (シェイプを表示したりサウンドを再生したり)。

&br;
定義タグはそれぞれ、ユニーク ID によって識別されます。ID の複製はできません。通常、 1 番目のキャラクタ ID には 1、 2 番目のキャラクタ ID には 2 というように割り当てられます。 0 番は特殊な null キャラクタとなります。

制御タグのみがディクショナリを参照するわけではありません。定義タグも、複雑なキャラクタを定義するためにディクショナリを参照することができます。例えば DefineButton と DefineSprite タグは、定義のために他のキャラクタを参照します。 DefineText タグは、他のフォントを選択するためにフォントキャラクタを参照することができます。

次の図は、定義タグと制御タグ、ディクショナリの関係を表しています。

&ref(dictionary.png,nolink);

### 移動 [#h14c184b]
* 前のページ : [SWF ファイル中のタグの順番](SWFの構造要約_SWF_ファイル中のタグの順番)
* 次のページ : [SWF ファイルの処理](SWFの構造要約_SWF_ファイルの処理)
