## ImportAssets [#t2e29c70]

ImportAssets タグは、キャラクタを他の SWF ファイルからインポートします。
インポートする SWF ファイルの場所は、 URL で指定します。
インポートされたアセットは、他のキャラクタと一緒にディクショナリに追加されます。

インポートする SWF ファイルの URL は、絶対パスまたは相対パスで指定します。
相対パスの場合、現在の SWF ファイルからの相対位置になります。

1 フレームの範囲内で、他のタグがインポートしたアセットに依存する場合、それよりも前に ImportAssets タグを配置する必要があります。

Flash Player 8 以降では、 ImportAssets は無視されます。
[ImportAssets2](制御タグ_ImportAssets2) タグを代わりに使ってください。

ImportAssets は、 SWF 5 以降 ～ SWF 7 以前の範囲で使用可能です。


### ImportAssets [#p3b2c90c]

|フィールド|型|コメント|
| --- | --- | --- |
|Header|[RECORDHEADER](SWFの構造要約_タグのフォーマット)|タグタイプ = 57|
|URL|[STRING](基本的なデータ型_文字列の値)|ソース SWF の URL|
|Count|[UI16](基本的なデータ型_整数型とバイトオーダー)|インポートするアセットの数|
|Tag1|[UI16](基本的なデータ型_整数型とバイトオーダー)|インポートする最初のキャラクタのキャラクタ ID&br;(エクスポート側の SWF ファイルとキャラクタ ID を合わせる必要はない)|
|Name1|[STRING](基本的なデータ型_文字列の値)|インポートする最初のキャラクタの識別子&br;(エクスポート側の SWF ファイルと識別子を合わせる必要がある)|
|・&br;・&br;・|||
|TagN|[UI16](基本的なデータ型_整数型とバイトオーダー)|インポートする最後のキャラクタのキャラクタ ID|
|NameN|[STRING](基本的なデータ型_文字列の値)|インポートする最後のキャラクタの識別子|

### 移動 [#u331bbd4]
* 前のページ : [ExportAssets](制御タグ_ExportAssets)
* 次のページ : [EnableDebugger](制御タグ_EnableDebugger)
