## ImportAssets2 [#y2c0f6c8]

ImportAssets2 タグは、 [ImportAssets](制御タグ_ImportAssets) を置き換えるもので、 SWF 8 以降で使用できます。
今のところ、機能的には ImportAssets2 と ImportAssets タグは同じものです。

ImportAssets2 タグは、キャラクタを他の SWF ファイルからインポートします。
インポートする SWF ファイルの場所は、 URL で指定します。
インポートされたアセットは、他のキャラクタと一緒にディクショナリに追加されます。

インポートする SWF ファイルの URL は、絶対パスまたは相対パスで指定します。
相対パスの場合、現在の SWF ファイルからの相対位置になります。

1 フレームの範囲内で、他のタグがインポートしたアセットに依存する場合、それよりも前に ImportAssets2 タグを配置する必要があります。

ImportAssets2 は、 SWF 8 以降で使用可能です。

### ImportAssets2 [#g28a00e0]

|フィールド|型|コメント|
| --- | --- | --- |
|Header|[RECORDHEADER](SWFの構造要約_タグのフォーマット)|タグタイプ = 71|
|URL|[STRING](基本的なデータ型_文字列の値)|ソース SWF の URL|
|Reserved|[UI8](基本的なデータ型_整数型とバイトオーダー)|常に 1|
|Reserved|[UI8](基本的なデータ型_整数型とバイトオーダー)|常に 0|
|Count|[UI16](基本的なデータ型_整数型とバイトオーダー)|インポートするアセットの数|
|Tag1|[UI16](基本的なデータ型_整数型とバイトオーダー)|インポートする最初のキャラクタのキャラクタ ID&br;(エクスポート側の SWF ファイルとキャラクタ ID を合わせる必要はない)|
|Name1|[STRING](基本的なデータ型_文字列の値)|インポートする最初のキャラクタの識別子&br;(エクスポート側の SWF ファイルと識別子を合わせる必要がある)|
|・&br;・&br;・|||
|TagN|[UI16](基本的なデータ型_整数型とバイトオーダー)|インポートする最後のキャラクタのキャラクタ ID|
|NameN|[STRING](基本的なデータ型_文字列の値)|インポートする最後のキャラクタの識別子|

### 移動 [#u331bbd4]
* 前のページ : [FileAttributes](制御タグ_FileAttributes)
* 次のページ : [SymbolClass](制御タグ_SymbolClass)
