## 座標系とTwips [#h8475f4c]

SWF ファイルフォーマットでは通常、整数型の X, Y 座標軸を使用します。
SWF フォーマットで twip と呼ばれるものは 1/20 論理ピクセルの大きさを表すもので、スケーリング無しの 100% で表示している時には 1 twip が丁度 1/20 ピクセルのサイズになります。
例えば、幅 800 twip、高さ 400 twip の矩形があるとすると、これは 幅 40、 高さ 20 論理ピクセルサイズになります。1 ピクセルに満たない大きさのものは、アンチエイリアシングで補完されます。790x390 twip の矩形 (39.5x19.5 ピクセル) は、端がわずかににじんだように表示されることになるでしょう。

SWF ファイルフォーマットでは、いつも通りのグラフィックス座標軸が使われます。
X は水平方向の軸を表し、左端が一番小さい値、右端が一番大きい値を表します。
Y は垂直方向の軸を表し、上端が一番小さい値、下端が一番大きい値を表します。

### 移動 [#d752f43b]
* 前のページ : [[基本的なデータ型]]
* 次のページ : [整数型とバイトオーダー](基本的なデータ型_整数型とバイトオーダー)
