## RGBA 色とアルファ値のレコード [#j41a1fed]

RGBA レコードは 32 bit の 赤・緑・青・アルファの値で色を表現します。
RGBA のアルファ値 255 は完全に不透明な値で、アルファ値 0 は完全に透明な値を表します。
アルファ値は 0 ～ 255 の範囲で透明度を設定します。

### RGBA 型 [#o9a24f03]
|フィールド|型|コメント|
| --- | --- | --- |
|Red|[UI8](基本的なデータ型_整数型とバイトオーダー)|赤色の値|
|Green|[UI8](基本的なデータ型_整数型とバイトオーダー)|緑色の値|
|Blue|[UI8](基本的なデータ型_整数型とバイトオーダー)|青色の値|
|Alpha|[UI8](基本的なデータ型_整数型とバイトオーダー)|アルファ値 透明度の設定|

### 移動 [#re214713]
* 前のページ : [RGB 色レコード](基本的なデータ型_RGB_色レコード)
* 次のページ : [ARGB 色とアルファ値のレコード](基本的なデータ型_ARGB_色とアルファ値のレコード)
